#+STARTUP: overview

* COMMENT Have to execute this code before use org-babel
  - to execute move cursor to the BEGIN line and do this: "Ctrl+c Ctrl+c"
==================================================================================
===================== How to coding java inside org with babel ===================
================================= START ==========================================

#+BEGIN_SRC emacs-lisp :result nil
  ;; This code below enable add and run java-code inside of org
  (org-babel-do-load-languages
    'org-babel-load-languages
       '((java . t)
	  ;;(python . t)
	 )
  )
  ;; stop emacs asking for confirmation, for this buffer only
  (setq-local org-confirm-babel-evaluate nil)
  (setq-local org-startup-indented t)
  (setq-local org-src-preserve-indentation nil)
  (setq-local org-edit-src-content-indentation 0)

#+END_SRC

#+RESULTS:
: 0

=================================== END ==========================================





* DONE COMMENT Create Table
** DONE Draw board
   Sketching in notability:
   - Play board
   - Winning posibility for both hounds and hare
** DONE Draw with javafx
   - The board
     
* DONE Create Pawn and move on table
  1. Create a simple pawn first
  2. Try to move the pawn with mouse click
  3. create more pawn

* PROCESS Write algorithm
  - Create "Table" to move peð and to check for winning
  - Remember that peð can only move one step
  - Winning posibility of both Hare and Hounds
    + Hare winning posibility:
      #+BEGIN_SRC java :classname hello :results output
	class hello {
	    public static void main(String[] args) {
		for(int i=0; i<3; i++) {
		    System.out.println("Hello not yet");
		    System.out.println("Whattt");
		    System.out.println("No export");
		    System.out.println("no saving?");
		}
	    }
	}
      #+END_SRC

      #+RESULTS:
      : Hello not yet
      : Hello not yet
      : Hello not yet

    
* TODO Skref
** Búa til Hare og Hounds class
*** Hounds class geri:
    1. Teikna 3 ferningar á borðið
    2. Færa ferningar um borðið
    3. Frysti mun bíða eftir búinn að forrita algoRithm class
*** Hare class geri:
    1. Teikna hringur á borðið
    2. Færa hringur um borðið
       
* TODO About the Game
** History
   The game seems to have originated in 19th century France, and became popular with French military officers during the Franco-Prussian War of 1870-1871. This gave rise to its alternative title "French Military Game". An article by Martin Gardner in the journal Scientific American generated further interest in the game in 1963, and it has become popular with computer programmers due to the ease of implementing its simple rules.
** Rules
   
